INSERT INTO stock (user_id, ticker, average_purchase_price, quantity)
VALUES
    ('user1', '삼성전자', 51000, 100),
    ('user1', 'SK하이닉스', 189700, 10),
    ('user1', '카카오', 41100, 50),
    ('user1', 'NAVER', 215000, 50),
    ('user1', '카페24', 46500, 10),
    ('user1', '오리엔트바이오', 1541, 50),
    ('user1', '한화오션', 56900, 30),
    ('user1', '삼성중공업', 12900, 20),
    ('user1', '한국석유', 15990, 20),
    ('user1', '한국가스공사', 36500, 10),
    ('user1', '지에스이', 3170, 40),
    ('user1', '대성에너지', 8390, 20),
    ('user1', '한화시스템', 23950, 100),
    ('user1', '한화생명', 2440, 20);