INSERT INTO stock (user_id, ticker, average_purchase_price, quantity)
VALUES
    ('user1', '삼성전자', 51000, 100),
    ('user1', 'SK하이닉스', 189700, 10),
    ('user1', '카카오', 41100, 50),
    ('user1', 'NAVER', 215000, 50),
    ('user1', '카페24', 46500, 10),
    ('user1', '오리엔트바이오', 1541, 50),
    ('user1', '한화오션', 56900, 30),
    ('user1', '삼성중공업', 12900, 20),
    ('user1', '한국석유', 15990, 20),
    ('user1', '한국가스공사', 36500, 10),
    ('user1', '지에스이', 3170, 40),
    ('user1', '대성에너지', 8390, 20),
    ('user1', '한화시스템', 23950, 100),
    ('user1', '한화생명', 2440, 20);

INSERT INTO stock (user_id, ticker, average_purchase_price, quantity)
VALUES
    ('user2', '한국석유', 16540, 10),   -- 현재가가 높아서 수량 10
    ('user2', '유니온', 6440, 100),     -- 현재가 * 수량이 644,000으로 조건을 충족
    ('user2', '유니온머티리얼', 2510, 42),   -- 수량이 42로 설정
    ('user2', '샘표식품', 25600, 10),   -- 현재가가 높아서 수량 10
    ('user2', '한국ANKOR유전', 383, 100),    -- 현재가가 낮아서 수량 100
    ('user2', 'KODEX 200액티브', 9405, 10),    -- 현재가가 높아서 수량 10
    ('user2', '한국패러랠', 156, 35),     -- 수량이 35로 설정
    ('user2', '삼화전자', 3360, 60),     -- 수량이 60으로 설정
    ('user2', '대성에너지', 8400, 10),   -- 현재가가 높아서 수량 10
    ('user2', '고려산업', 2935, 100),    -- 현재가 * 수량이 293,500으로 조건을 충족
    ('user2', '신송홀딩스', 6790, 23),   -- 수량이 23으로 설정
    ('user2', 'RISE 코리아금융고배당', 9805, 10),   -- 현재가가 높아서 수량 10
    ('user2', '태경비케이', 4620, 40),    -- 수량이 40으로 설정
    ('user2', '현대비앤지스틸', 13260, 10),   -- 현재가가 높아서 수량 10
    ('user2', 'TIMEFOLIO 코스피액티브', 8975, 77);  -- 수량이 77로 설정

INSERT INTO stock (user_id, ticker, average_purchase_price, quantity)
VALUES
    ('user3', '삼성 인버스 2X 항셍테크 ETN(H) B', 9855, 10),
    ('user3', 'TIGER TSMC파운드리밸류체인', 15770, 10),
    ('user3', 'TIGER 현대차그룹+펀더멘털', 26805, 10),
    ('user3', '동양철관', 677, 3000),
    ('user3', '그린케미칼', 6630, 300),
    ('user3', 'ACE 애플밸류체인액티브', 10715, 10),
    ('user3', 'GS글로벌', 2580, 100),
    ('user3', '모토닉', 8400, 300),
    ('user3', '한국가스공사', 36350, 10),
    ('user3', '상상인증권', 424, 500),
    ('user3', '삼성 레버리지 항셍테크 ETN(H) B', 30960, 10),
    ('user3', 'DSR제강', 3500, 300),
    ('user3', '케이탑리츠', 989, 500),
    ('user3', 'KIWOOM 코스닥150선물레버리지', 3605, 500),
    ('user3', '유니드', 68300, 10);

INSERT INTO stock (user_id, ticker, average_purchase_price, quantity)
VALUES
    ('user4', 'KODEX 미국달러선물인버스2X', 5100, 10),
    ('user4', '일신석재', 1930, 10),
    ('user4', '삼부토건', 890, 48),
    ('user4', '한솔홈데코', 900, 10),
    ('user4', 'GS글로벌', 2580, 10),
    ('user4', '대원전선', 3330, 10),
    ('user4', 'TIGER 화장품', 2580, 10),
    ('user4', '한국가스공사', 36350, 10),
    ('user4', 'TIGER 미국테크TOP10 INDXX', 24370, 10),
    ('user4', '한국무브넥스', 6000, 10),
    ('user4', 'TIGER 200', 32520, 10),
    ('user4', '넥스틸', 8850, 10),
    ('user4', '에이프로젠', 735, 100),
    ('user4', 'TIGER 차이나항셍테크', 7680, 10),
    ('user4', 'KODEX 미국S&P500', 19860, 10);

INSERT INTO stock (user_id, ticker, average_purchase_price, quantity)
VALUES
    ('user5', '서울식품', 140, 10),
    ('user5', '기아', 96100, 10),
    ('user5', 'SG글로벌', 3485, 10),
    ('user5', 'KODEX AI전력핵심설비', 10815, 10),
    ('user5', '한화비전', 30800, 10),
    ('user5', '삼익악기', 1216, 10),
    ('user5', '태경비케이', 4620, 49),
    ('user5', '흥아해운', 1714, 10),
    ('user5', '대한전선', 12650, 10),
    ('user5', 'ACE 포스코그룹포커스', 4130, 10);